Results/OneReplicaLatencies/yeast/GRACE/results.txt
/Users/pandey/.sdkman/candidates/java/current/bin/java  -classpath /Users/pandey/work/GRACE/YCSB/conf:/Users/pandey/work/GRACE/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/Users/pandey/work/GRACE/YCSB/grace/target/grace-binding-0.18.0-SNAPSHOT.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/antlr4-runtime-4.9.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/arangodb-java-driver-7.22.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/bson-5.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/bson-record-codec-5.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/caffeine-2.3.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-beanutils-1.9.4.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-collections-3.2.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-configuration2-2.8.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-lang3-3.12.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-logging-1.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/commons-text-1.10.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/core-7.22.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/error_prone_annotations-2.11.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/exp4j-0.4.8.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/failureaccess-1.0.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-core-3.6.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-driver-3.7.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-groovy-3.6.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-language-3.6.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-shaded-3.6.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/gremlin-util-3.7.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-2.5.15-indy.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-cli-picocli-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-console-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-groovysh-2.5.15-indy.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-json-2.5.15-indy.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-jsr223-2.5.15-indy.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-swing-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-templates-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/groovy-xml-2.5.15.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/guava-31.1-jre.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/HdrHistogram-2.1.12.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/hppc-0.7.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/htrace-core4-4.1.0-incubating.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/http-protocol-7.22.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/ivy-2.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/j2objc-annotations-1.3.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-annotations-2.19.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-core-2.19.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-databind-2.19.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-datatype-jakarta-jsonp-2.19.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jackson-serde-json-7.22.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jakarta.json-api-2.1.3.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/janusgraph-driver-1.0.0-rc2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/javatuples-1.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jbcrypt-0.4.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jcabi-log-0.20.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jcabi-manifests-1.2.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jcl-over-slf4j-1.7.25.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jline-2.14.6.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jsr305-3.0.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/jts-core-1.17.0.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/mongodb-driver-core-5.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/mongodb-driver-sync-5.5.1.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/neo4j-java-driver-4.4.3.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-all-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-buffer-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-dns-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-haproxy-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-http-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-http2-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-memcache-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-mqtt-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-redis-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-smtp-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-socks-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-stomp-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-codec-xml-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-common-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-handler-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-handler-proxy-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-handler-ssl-ocsp-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-dns-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-dns-classes-macos-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-aarch_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-x86_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-classes-epoll-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-classes-kqueue-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-aarch_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-x86_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-aarch_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-x86_64.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-native-unix-common-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-rxtx-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-sctp-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/netty-transport-udt-4.1.86.Final.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/noggit-0.8.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/picocli-4.3.2.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/reactive-streams-1.0.3.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/slf4j-api-1.7.25.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/snakeyaml-1.32.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/spatial4j-0.8.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-auth-common-4.5.7.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-core-4.5.7.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-uri-template-4.5.7.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-web-client-4.5.7.jar:/Users/pandey/work/GRACE/YCSB/grace/target/dependency/vertx-web-common-4.5.7.jar site.ycsb.Client -t -db site.ycsb.db.GraceClient -P workloads/workload_grace -p HOSTURI=http://localhost:3000 -p DBTYPE=memgraph -p DBURI=bolt://localhost:7687 -p maxexecutiontime=60 -p threadcount=1 -p loadVertexFile=/Users/pandey/work/GRACE/GraphDBData/yeast_load_vertices.json -p loadEdgeFile=/Users/pandey/work/GRACE/GraphDBData/yeast_load_edges.json -p vertexAddFile=/Users/pandey/work/GRACE/GraphDBData/yeast_update_vertices.json -p edgeAddFile=/Users/pandey/work/GRACE/GraphDBData/yeast_update_edges.json
Loaded 1902 vertices and 7259 edges
Initializing db: site.ycsb.db.GraceClient
GraceClient  Created
Using Database: site.ycsb.DBWrapper
Starting GRACE client
{deleteproportion=1, loadEdgeFile=/Users/pandey/work/GRACE/GraphDBData/yeast_load_edges.json, recordcount=10000, operationcount=20000000, loadVertexFile=/Users/pandey/work/GRACE/GraphDBData/yeast_load_vertices.json, edgeAddFile=/Users/pandey/work/GRACE/GraphDBData/yeast_update_edges.json, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, updateproportion=1, DBTYPE=memgraph, dotransactions=true, HOSTURI=http://localhost:3000, createproportion=1, DBURI=bolt://localhost:7687, maxexecutiontime=60, vertexAddFile=/Users/pandey/work/GRACE/GraphDBData/yeast_update_vertices.json, readallfields=true, db=site.ycsb.db.GraceClient, requestdistribution=latest}
GRACE HOSTURI: http://localhost:3000
DBTYPE: memgraph
DBURI: bolt://localhost:7687
[OVERALL], RunTime(ms), 60008
[OVERALL], Throughput(ops/sec), 423.79349420077324
[TOTAL_GCS_G1_Young_Generation], Count, 6
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 11
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.018330889214771363
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 11
[TOTAL_GC_TIME_%], Time(%), 0.018330889214771363
[REMOVE_VERTEX], Operations, 459
[REMOVE_VERTEX], AverageLatency(us), 3001.1416122004357
[REMOVE_VERTEX], MinLatency(us), 2001
[REMOVE_VERTEX], MaxLatency(us), 8839
[REMOVE_VERTEX], 50thPercentileLatency(us), 2823
[REMOVE_VERTEX], 95thPercentileLatency(us), 4311
[REMOVE_VERTEX], 99thPercentileLatency(us), 5271
[REMOVE_VERTEX], Return=OK, 459
[GET_EDGE_WITH_PROPERTY], Operations, 1839
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 1163.377922784122
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 412
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 37503
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 849
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 2507
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 3273
[GET_EDGE_WITH_PROPERTY], Return=OK, 1839
[ADD_EDGE], Operations, 1791
[ADD_EDGE], AverageLatency(us), 3589.671133445003
[ADD_EDGE], MinLatency(us), 2450
[ADD_EDGE], MaxLatency(us), 16343
[ADD_EDGE], 50thPercentileLatency(us), 3351
[ADD_EDGE], 95thPercentileLatency(us), 5043
[ADD_EDGE], 99thPercentileLatency(us), 8139
[ADD_EDGE], Return=OK, 1791
[GET_VERTEX_WITH_PROPERTY], Operations, 1817
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 1182.834892680242
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 424
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 14119
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 862
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 2523
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 3495
[GET_VERTEX_WITH_PROPERTY], Return=OK, 1817
[ADD_VERTEX], Operations, 459
[ADD_VERTEX], AverageLatency(us), 2880.335511982571
[ADD_VERTEX], MinLatency(us), 1817
[ADD_VERTEX], MaxLatency(us), 9199
[ADD_VERTEX], 50thPercentileLatency(us), 2675
[ADD_VERTEX], 95thPercentileLatency(us), 4303
[ADD_VERTEX], 99thPercentileLatency(us), 6687
[ADD_VERTEX], Return=OK, 459
[REMOVE_EDGE_PROPERTY], Operations, 1949
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 4308.3981528989225
[REMOVE_EDGE_PROPERTY], MinLatency(us), 3004
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 15679
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 4083
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 5855
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 8087
[REMOVE_EDGE_PROPERTY], Return=OK, 1949
[REMOVE_EDGE], Operations, 1747
[REMOVE_EDGE], AverageLatency(us), 5589.919862621637
[REMOVE_EDGE], MinLatency(us), 4156
[REMOVE_EDGE], MaxLatency(us), 39551
[REMOVE_EDGE], 50thPercentileLatency(us), 5351
[REMOVE_EDGE], 95thPercentileLatency(us), 7131
[REMOVE_EDGE], 99thPercentileLatency(us), 10063
[REMOVE_EDGE], Return=OK, 1747
[GET_EDGE_LABELS], Operations, 1803
[GET_EDGE_LABELS], AverageLatency(us), 1163.073765945646
[GET_EDGE_LABELS], MinLatency(us), 415
[GET_EDGE_LABELS], MaxLatency(us), 8263
[GET_EDGE_LABELS], 50thPercentileLatency(us), 858
[GET_EDGE_LABELS], 95thPercentileLatency(us), 2497
[GET_EDGE_LABELS], 99thPercentileLatency(us), 3535
[GET_EDGE_LABELS], Return=OK, 1803
[REMOVE_VERTEX_PROPERTY], Operations, 1753
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 3079.4198516828296
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 1960
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 34463
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 2797
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 4531
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 7095
[REMOVE_VERTEX_PROPERTY], Return=OK, 1753
[GET_VERTEX_COUNT], Operations, 1817
[GET_VERTEX_COUNT], AverageLatency(us), 1190.190423775454
[GET_VERTEX_COUNT], MinLatency(us), 399
[GET_VERTEX_COUNT], MaxLatency(us), 30431
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 880
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 2557
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 3429
[GET_VERTEX_COUNT], Return=OK, 1817
[GET_EDGES_WITH_LABEL], Operations, 1864
[GET_EDGES_WITH_LABEL], AverageLatency(us), 1292.299356223176
[GET_EDGES_WITH_LABEL], MinLatency(us), 422
[GET_EDGES_WITH_LABEL], MaxLatency(us), 116287
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 951
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 2615
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 3633
[GET_EDGES_WITH_LABEL], Return=OK, 1864
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 0.0
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 0
[CLEANUP], 50thPercentileLatency(us), 0
[CLEANUP], 95thPercentileLatency(us), 0
[CLEANUP], 99thPercentileLatency(us), 0
[SET_EDGE_PROPERTY], Operations, 1812
[SET_EDGE_PROPERTY], AverageLatency(us), 4466.128035320088
[SET_EDGE_PROPERTY], MinLatency(us), 2990
[SET_EDGE_PROPERTY], MaxLatency(us), 40191
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 4143
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 5971
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 9231
[SET_EDGE_PROPERTY], Return=OK, 1812
[SET_VERTEX_PROPERTY], Operations, 1868
[SET_VERTEX_PROPERTY], AverageLatency(us), 3074.1734475374733
[SET_VERTEX_PROPERTY], MinLatency(us), 1975
[SET_VERTEX_PROPERTY], MaxLatency(us), 73855
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 2821
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 4319
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 6703
[SET_VERTEX_PROPERTY], Return=OK, 1868
[GET_EDGE_COUNT], Operations, 1767
[GET_EDGE_COUNT], AverageLatency(us), 1149.2710809281268
[GET_EDGE_COUNT], MinLatency(us), 372
[GET_EDGE_COUNT], MaxLatency(us), 7883
[GET_EDGE_COUNT], 50thPercentileLatency(us), 848
[GET_EDGE_COUNT], 95thPercentileLatency(us), 2505
[GET_EDGE_COUNT], 99thPercentileLatency(us), 3587
[GET_EDGE_COUNT], Return=OK, 1767